In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
data = pd.Series(tuple(['서울', '부산', '대전']))
data

0    서울
1    부산
2    대전
dtype: object

In [6]:
data = pd.Series({'서울' : 1, '부산' :2, '대전' :3})
data

서울    1
부산    2
대전    3
dtype: int64

In [8]:
data = pd.DataFrame([['서울', '부산', '대전'], [1,2,3]])
data

    0   1   2
0  서울  부산  대전
1   1   2   3

In [10]:
type(data[0])

pandas.core.series.Series

In [11]:
df = pd.DataFrame({"강남구":[1,2,3], 
                   "영등포구":[4,5,6],
                   "서초구":[7,8,9]})
df

   강남구  영등포구  서초구
0    1     4    7
1    2     5    8
2    3     6    9

In [12]:
df["강남구"] # 인덱스, 강남구 영등포구 -> 칼럼

0    1
1    2
2    3
Name: 강남구, dtype: int64

In [14]:
df.columns = ['강남', '영등포', '서초']
df.index = ['1주차', '2주차', '3주차']
df

     강남  영등포  서초
1주차   1    4   7
2주차   2    5   8
3주차   3    6   9

In [17]:
df.rename(columns={'강남':'강남구'}) # 원본은 변경되지 않음
df

     강남  영등포  서초
1주차   1    4   7
2주차   2    5   8
3주차   3    6   9

데이터 조회하기

In [20]:
df.loc[['1주차', '2주차']]

     강남  영등포  서초
1주차   1    4   7
2주차   2    5   8

In [30]:
df.iloc[1:, :2] # 행 / 열  순서

     강남  영등포
2주차   2    5
3주차   3    6

In [33]:
df.iloc[:, :2]

     강남  영등포
1주차   1    4
2주차   2    5
3주차   3    6

In [34]:
df

     강남  영등포  서초
1주차   1    4   7
2주차   2    5   8
3주차   3    6   9

In [35]:
df[df['영등포'] >=5 ]

     강남  영등포  서초
2주차   2    5   8
3주차   3    6   9

In [37]:
df[df['강남'] >=5 ]

Empty DataFrame
Columns: [강남, 영등포, 서초]
Index: []

랜덤 추출

In [38]:
data = pd.DataFrame({
    "지역명" : ['강남', '서초', '노원'],
    '번호' : [1,2,3],
    '매출' : [100, 200, 300]
})

In [39]:
data.index = ['1월', '2월', '3월']
data

   지역명  번호   매출
1월  강남   1  100
2월  서초   2  200
3월  노원   3  300

In [40]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, 1월 to 3월
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   지역명     3 non-null      object
 1   번호      3 non-null      int64
 2   매출      3 non-null      int64
dtypes: int64(2), object(1)
memory usage: 96.0+ bytes

In [42]:
data.describe()

        번호     매출
count  3.0    3.0
mean   2.0  200.0
std    1.0  100.0
min    1.0  100.0
25%    1.5  150.0
50%    2.0  200.0
75%    2.5  250.0
max    3.0  300.0

In [48]:
data["매출"] + data['번호']
# pandas -> numpy array 구조

1월    101
2월    202
3월    303
dtype: int64

##### 데이터 처리
- 외부 데이터 처리
- 외부 데이터 읽어오기
- 외부 데이터 파악해보기
- 원하는 칼럼 선택하기

In [51]:
df = pd.read_csv("cdata.csv", index_col=0)
df

        이름  나이  지역
index
1      홍길동  25  서울
2      김준기  21  서울
9      이명식  22  부산
32     방준혁  24  광주
47     최명기  31  부산

In [56]:
df = pd.read_csv("cdata_nohead.csv", header=None, names = ["이름", "나이", "지역"])
df

     이름  나이  지역
1   홍길동  25  서울
2   김준기  21  서울
9   이명식  22  부산
32  방준혁  24  광주
47  최명기  31  부산

In [60]:
df = pd.read_csv("cdata_nohead.csv", header=None)
df.columns = ["INDEX", "NAME", "AGE", "LOCATION"]
df

   INDEX NAME  AGE LOCATION
0      1  홍길동   25       서울
1      2  김준기   21       서울
2      9  이명식   22       부산
3     32  방준혁   24       광주
4     47  최명기   31       부산

##### 엑셀 파일 불러오기

In [64]:
!pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\gf76\.conda\envs\sesac2024\lib\site-packages (3.1.2)
Requirement already satisfied: et-xmlfile in c:\users\gf76\.conda\envs\sesac2024\lib\site-packages (from openpyxl) (1.1.0)

In [63]:
df = pd.read_excel('cdata.xlsx')
df

   index   이름  나이  지역
0      1  홍길동  25  서울
1      2  김준기  21  서울
2      9  이명식  22  부산
3     32  방준혁  24  광주
4     47  최명기  31  부산

1. 데이터 확인
2. 결측치 처리

In [65]:
df = pd.read_csv('cdata_nan.csv')
df

   index   이름    나이   지역
0      1  홍길동  25.0   서울
1      2  김준기   NaN   서울
2      9  이명식  22.0  NaN
3     32  방준혁   NaN   광주
4     47  최명기  31.0   부산

In [66]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   index   5 non-null      int64
 1   이름      5 non-null      object
 2   나이      3 non-null      float64
 3   지역      4 non-null      object
dtypes: float64(1), int64(1), object(2)
memory usage: 292.0+ bytes

In [68]:
df.head(3)

   index   이름    나이   지역
0      1  홍길동  25.0   서울
1      2  김준기   NaN   서울
2      9  이명식  22.0  NaN

In [70]:
df.isnull()
df.dropna()

   index   이름    나이  지역
0      1  홍길동  25.0  서울
4     47  최명기  31.0  부산

In [71]:
df.fillna(0)

   index   이름    나이  지역
0      1  홍길동  25.0  서울
1      2  김준기   0.0  서울
2      9  이명식  22.0   0
3     32  방준혁   0.0  광주
4     47  최명기  31.0  부산

In [74]:
df['나이'] = df['나이'].fillna(25)
df

   index   이름    나이   지역
0      1  홍길동  25.0   서울
1      2  김준기  25.0   서울
2      9  이명식  22.0  NaN
3     32  방준혁  25.0   광주
4     47  최명기  31.0   부산

In [75]:
df['지역'] = df['지역'].fillna("광주")
df

   index   이름    나이  지역
0      1  홍길동  25.0  서울
1      2  김준기  25.0  서울
2      9  이명식  22.0  광주
3     32  방준혁  25.0  광주
4     47  최명기  31.0  부산

##### 정렬

In [77]:
df = pd.read_csv("cdata_nohead.csv", header=None, index_col=0)
df

      1   2   3
0
1   홍길동  25  서울
2   김준기  21  서울
9   이명식  22  부산
32  방준혁  24  광주
47  최명기  31  부산

In [86]:
new_df = df.sort_values(by=2, ascending= False)
new_df

      1   2   3
0
47  최명기  31  부산
1   홍길동  25  서울
32  방준혁  24  광주
9   이명식  22  부산
2   김준기  21  서울